---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PointOnEdgeFaceIntersection Properties
PointOnEdgeFaceIntersection Class See Also Send Feedback
---

The PointOnEdgeFaceIntersection type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | OrientWithEdge | Whether to orient the ReferencePoint to the edge or the face. |

# See Also

PointOnEdgeFaceIntersection Class

Autodesk.Revit.DB Namespace